# 산술연산자
# +(뎃셈), -(뺄셈), *(곱), /(나눔)
# //(몫), %(나머지), **(제곱)

# print(10+20)
# print(10-20)
# print(10*20)
# print(10/20)
# print(10/3) # 3.3333333
# print(10//3)# 3
# print(10%3) # 1나머지
# print(10**3)# 10*10*10=1000

# 두수를 입력받아 위의 연산을 출력하시오.
# + - * / // % **

# n1=int(input("enter a number"))
# n2=int(input("enter a number"))
# print(n1+n2)
# print(n1-n2)
# print(n1*n2)
# print(n1/n2)
# print(n1//n2)
# print(n1%n2)
# print(n1**n2)


### 780원 동전으로 교환
### 500원, 100원, 50원, 10원 몇개로 교환?
# 값/500

# c1=780//500
# c2=(780%500)//100
# c3=((780%500)%100)//50
# c4=(((780%500)%100)%50)//10

# print("500원 동전 : %d" % c1)
# print("100원 동전 : %d" % c2)
# print("50원 동전 : %d" % c3)
# print("10원 동전 : %d" % c4)


money=1597000
# 50000원, 10000원, 5000원, 1000원
won1=money//50000
c1=money%50000
won2=c1//10000
c2=c1%10000
won3=c2//5000
c3=c2%5000
won4=c3//1000
c4=c3%1000

print("50000원권 : %d" % won1)
print("10000원권 : %d" % won2)
print("5000원권 : %d" % won3)
print("1000원권 : %d" % won4)
print("%d원은 지폐로 교환불가" % c4)








# total=int(input("금액을 입력하시오. "))
# C1=total//500
# l1=total%500
# C2=l1//100
# l2=l1%100
# C3=l2//50
# l3=l2%50
# C4=l3//10
# l4=l3%10


# print("-"*50)
# print("%s\t%s\t%s\t%s\t%s" % ("금액","500원","100원","50원","10원"))
# print("-"*50)